[
    {
        "anchor": {
            "event": "A sudden microburst warning flashed across the screen, demanding immediate rerouting of three inbound flights.",
            "d_days": 0.0,
            "emotional_state": "A jolt of adrenaline, a cold knot forming in the stomach.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Successfully guided a disabled aircraft through heavy fog to an emergency landing strip, avoiding a potential disaster.",
            "d_days": 10.0,
            "emotional_state": "A powerful rush of relief washing over me, followed by a sustained hum of professional pride.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "A routine morning shift, coordinating standard flight paths and managing minor delays.",
            "d_days": 11.5,
            "emotional_state": "A calm, steady focus, the gentle rhythm of concentration.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Attending an air traffic control seminar, discussing new radar technologies for weather detection.",
            "d_days": 75.0,
            "emotional_state": "A quiet engagement with new information, a feeling of intellectual curiosity.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "The main radar system flickered and died for a few critical seconds during peak traffic due to a power surge.",
            "d_days": 0.0,
            "emotional_state": "A sharp, icy dread that tightened my chest.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Managed to avert a mid-air collision by issuing rapid, precise instructions to two converging flights during unexpected turbulence.",
            "d_days": 45.0,
            "emotional_state": "An electric surge of triumphant energy, a deep satisfaction in the core of my being.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Reviewed standard operating procedures for equipment failure, a mandatory annual training session.",
            "d_days": 46.5,
            "emotional_state": "A methodical, procedural frame of mind, a sense of dutiful review.",
            "emotional_intensity": 0.25
        },
        "semantic_distractor": {
            "event": "Observed new air traffic controllers learning to use the radar system in a simulation, correcting their errors.",
            "d_days": 120.0,
            "emotional_state": "A patient attentiveness, a mild sense of nostalgic understanding.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Multiple aircraft entered holding patterns simultaneously as a sudden hailstorm made landing impossible for an hour.",
            "d_days": 0.0,
            "emotional_state": "A mounting pressure behind my eyes, a feeling of being overwhelmed.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Successfully coordinated the safe diversion of an international flight with a medical emergency to the nearest available airport.",
            "d_days": 30.0,
            "emotional_state": "A profound sense of accomplishment, a warm glow of knowing I made a difference.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Helped a colleague troubleshoot a minor issue with their headset during a quiet shift.",
            "d_days": 29.0,
            "emotional_state": "A relaxed camaraderie, a momentary focus on a small task.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Participated in a regional meeting discussing best practices for managing aircraft during large sporting events.",
            "d_days": 90.0,
            "emotional_state": "An engaged interest in collaborative problem-solving, a feeling of collective effort.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Received a call from a pilot reporting severe turbulence and loss of altitude in a small regional jet.",
            "d_days": 0.0,
            "emotional_state": "A hollow, sinking feeling in the chest, a surge of focused alarm.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Successfully guided a single-engine plane experiencing engine trouble to a safe landing on an unfamiliar runway.",
            "d_days": 365.0,
            "emotional_state": "A deep, resonant pride resonating through my body, a quiet satisfaction.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Attended a flight safety review discussing new procedures for reporting engine malfunctions.",
            "d_days": 366.0,
            "emotional_state": "A studious attention to detail, a feeling of absorbing important information.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Observed a new simulator program designed to train pilots on emergency landing procedures.",
            "d_days": 150.0,
            "emotional_state": "A contemplative observation, a sense of analytical scrutiny.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "A pilot reported losing visual contact with the runway due to torrential rain during final approach.",
            "d_days": 0.0,
            "emotional_state": "A tight knot of anxiety in my stomach, a heightened state of alert.",
            "emotional_intensity": 0.88
        },
        "positive": {
            "event": "Coordinated a successful rescue operation for a downed military helicopter in a remote, mountainous region.",
            "d_days": 2000.0,
            "emotional_state": "A profound sense of contributing to life-saving efforts, a quiet reverence.",
            "emotional_intensity": 0.92
        },
        "temporal_distractor": {
            "event": "Filled out annual paperwork for my security clearance, a tedious but necessary task.",
            "d_days": 2001.0,
            "emotional_state": "A mild irritation, a sense of bureaucratic obligation.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Supervised a training exercise for search and rescue teams, reviewing their communication protocols.",
            "d_days": 60.0,
            "emotional_state": "An evaluative focus, a sense of ensuring competence.",
            "emotional_intensity": 0.35
        }
    },
    {
        "anchor": {
            "event": "My grandchild giggled with delight as we carefully placed a tiny sunflower seed into the soil, patting it gently.",
            "d_days": 0.0,
            "emotional_state": "A warmth spreading through my chest, a sense of gentle joy and connection.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Watching my grandchild's face light up with pure wonder when the first tiny sprout pushed through the dirt. They yelled 'It's alive, Grandma!'",
            "d_days": 12.0,
            "emotional_state": "A powerful surge of proud affection, a deep sense of shared discovery.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I spent the morning sorting through old photographs, remembering vacations from years ago.",
            "d_days": 13.0,
            "emotional_state": "A quiet contentment, a soft nostalgia.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Last year, my grandchild and I made a birdhouse out of recycled milk cartons and painted it bright colors.",
            "d_days": 380.0,
            "emotional_state": "A pleasant feeling of creative accomplishment and shared activity.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "We watered the newly planted seeds, and my grandchild splashed a little water on their nose, making a funny face.",
            "d_days": 0.0,
            "emotional_state": "A lighthearted amusement, a bubbling joy in shared silliness.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My grandchild ran to show me a bright red ladybug crawling on one of the sunflower leaves, their eyes wide with excitement.",
            "d_days": 35.0,
            "emotional_state": "A gentle thrill of innocent curiosity, a deep satisfaction in their wonder.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "I had a phone call with my friend, catching up on her recent trip to the mountains.",
            "d_days": 36.0,
            "emotional_state": "A sense of easy connection and interest.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "My grandchild helped me harvest ripe tomatoes from the garden last summer, their tiny hands carefully picking the red fruit.",
            "d_days": 400.0,
            "emotional_state": "A feeling of satisfying productivity and shared bounty.",
            "emotional_intensity": 0.7
        }
    },
    {
        "anchor": {
            "event": "I explained how the sun helps the plants grow, pointing up to the sky, and my grandchild tried to reach for it.",
            "d_days": 0.0,
            "emotional_state": "A tender feeling of imparting wisdom, a gentle amusement at their earnestness.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "My grandchild carefully drew a picture of our garden, with big sunflowers and a smiling sun, and gave it to me as a gift.",
            "d_days": 88.0,
            "emotional_state": "A profound warmth in my chest, a deep sense of being cherished.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I spent an hour reading a book on local history, learning about the old mills in town.",
            "d_days": 87.0,
            "emotional_state": "A quiet absorption and intellectual curiosity.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "We spent an afternoon painting rocks for the garden, making them look like ladybugs and bumblebees.",
            "d_days": 120.0,
            "emotional_state": "A pleasant feeling of creative expression and playful engagement.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "My grandchild asked if the seeds would turn into 'giant flowers' and I assured them they would, with a big smile.",
            "d_days": 0.0,
            "emotional_state": "A joyful lightness in my heart, a profound sense of hopeful anticipation.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "We measured the growing sunflowers against my grandchild's height, and they cheered excitedly when a sunflower was taller than them!",
            "d_days": 50.0,
            "emotional_state": "An exhilarating burst of shared triumph, a deep connection through playful competition.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I went to the grocery store to pick up ingredients for dinner, navigating the busy aisles.",
            "d_days": 49.0,
            "emotional_state": "A mild sense of task-oriented focus and efficiency.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "A few months ago, my grandchild and I went to the botanical garden and saw many different types of beautiful flowers.",
            "d_days": 100.0,
            "emotional_state": "A calm appreciation for beauty and a sense of shared wonder.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "We dug small holes in the soil with a trowel, and my grandchild loved getting their hands a little dirty.",
            "d_days": 0.0,
            "emotional_state": "A grounding sense of natural connection, a simple pleasure in tactile exploration.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "My grandchild carefully collected fallen sunflower petals, arranging them into a 'flower crown' for me to wear.",
            "d_days": 65.0,
            "emotional_state": "A tender rush of unconditional love, a deep sense of being adored.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I helped my neighbor carry some heavy boxes from her car into her house.",
            "d_days": 66.0,
            "emotional_state": "A sense of helpfulness and slight physical exertion.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "We replanted some small herb plants from pots into a larger garden bed earlier this spring.",
            "d_days": 130.0,
            "emotional_state": "A satisfying sense of nurturing growth and practical gardening.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "The site went completely down at 3 AM. Woke up to a barrage of alerts. Heart racing, started debugging immediately.",
            "d_days": 0.0,
            "emotional_state": "A jolt of adrenaline mixed with dread, a cold knot forming in the stomach.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Fixed a critical memory leak in production after 18 hours straight. The 'all clear' message from monitoring felt like a massive weight lifting.",
            "d_days": 7.0,
            "emotional_state": "A wave of profound relief and exhaustion, a deep sense of accomplishment.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Had a late-night video call with a friend in a different time zone. Discussed vacation plans.",
            "d_days": 7.5,
            "emotional_state": "A calm, pleasant feeling of connection and mild anticipation.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Reviewed old incident reports for a new hire's onboarding, saw a similar outage from a year ago.",
            "d_days": 120.0,
            "emotional_state": "A detached, analytical state of mind, slightly nostalgic for the past team.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Found the root cause of the current outage: a misconfigured load balancer rule pushed last week. The frustration is palpable.",
            "d_days": 0.0,
            "emotional_state": "A surge of acute frustration and a tight tension in the jaw.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Successfully migrated the legacy database to a new, faster cluster without any downtime. It was a risky operation that paid off.",
            "d_days": 45.0,
            "emotional_state": "An electric surge of triumphant energy and a swelling of pride.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Attended a virtual tech conference, learned about new advancements in database security.",
            "d_days": 44.5,
            "emotional_state": "A quiet, engaged curiosity and intellectual stimulation.",
            "emotional_intensity": 0.5
        },
        "semantic_distractor": {
            "event": "Debated with a colleague about the best load balancing strategy for a new microservice architecture.",
            "d_days": 70.0,
            "emotional_state": "A focused, analytical drive to find the optimal solution.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "The site is still down. Customer support is overloaded. The pressure to get it back online is immense.",
            "d_days": 0.0,
            "emotional_state": "An overwhelming sense of responsibility and a deep-seated anxiety, a cold dread in the pit of the stomach.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Received unexpected positive feedback from a senior VP about my performance during a critical incident last year.",
            "d_days": 365.0,
            "emotional_state": "A warm glow of validation and a quiet sense of personal worth.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Helped my neighbor fix their internet connection issues, which involved troubleshooting their router.",
            "d_days": 366.0,
            "emotional_state": "A mild satisfaction from a small act of helpfulness.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Had a difficult conversation with a customer about a recurring bug in our support portal.",
            "d_days": 90.0,
            "emotional_state": "A feeling of mild exasperation and a commitment to resolution.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Restarted the main application servers. Waiting anxiously to see if they come back online and if the errors clear.",
            "d_days": 0.0,
            "emotional_state": "A nervous tension in the shoulders, a churning uncertainty in the gut.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "After weeks of preparation, successfully launched the new feature with zero critical bugs. Celebration with the team was great.",
            "d_days": 14.0,
            "emotional_state": "A bubbling excitement and a deep sense of shared success.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Finished reorganizing my personal photo albums on my computer, deleting duplicates.",
            "d_days": 14.5,
            "emotional_state": "A mild, methodical satisfaction from completing a tedious task.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Had to restart my home network after a power flicker, bringing all my devices back online.",
            "d_days": 65.0,
            "emotional_state": "A minor annoyance, quickly resolved, leading to renewed functionality.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Discovered the monitoring system itself had a bug and wasn't reporting critical metrics, delaying our detection of the outage.",
            "d_days": 0.0,
            "emotional_state": "A hollow, sinking feeling in the chest, coupled with disbelief and self-reproach.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Mentored a junior engineer who then independently solved a complex, long-standing infrastructure problem.",
            "d_days": 2000.0,
            "emotional_state": "A profound sense of pride and fulfillment, seeing growth and achievement.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Watched a documentary about the history of space exploration, learned about early rocket launches.",
            "d_days": 1999.0,
            "emotional_state": "A sense of wonder and intellectual fascination, a feeling of awe.",
            "emotional_intensity": 0.5
        },
        "semantic_distractor": {
            "event": "Attended a workshop on setting up robust cloud monitoring and alerting dashboards.",
            "d_days": 100.0,
            "emotional_state": "An engaged, proactive desire to learn and improve systems.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "I spent all night observing Comet Halley, barely sleeping, but the view through my telescope was breathtaking.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of wonder and connection to the cosmos.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Successfully captured a stunning long-exposure photo of the Andromeda Galaxy, perfectly framed.",
            "d_days": 14.0,
            "emotional_state": "A burst of satisfaction and creative fulfillment.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Finished reorganizing the garage, sorting through old tools and forgotten boxes.",
            "d_days": 13.0,
            "emotional_state": "A dull sense of routine accomplishment.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Attended a lecture on deep-sky astrophotography, learning new techniques for capturing distant galaxies.",
            "d_days": 75.0,
            "emotional_state": "A focused, intellectual curiosity.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "My new equatorial mount finally arrived after months of waiting, I was like a kid on Christmas morning.",
            "d_days": 0.0,
            "emotional_state": "An electric surge of eager anticipation and delight.",
            "emotional_intensity": 0.92
        },
        "positive": {
            "event": "Discovered a faint, previously uncatalogued double star during a casual observation session, felt a rush of discovery.",
            "d_days": 60.0,
            "emotional_state": "A sudden thrill of validation and excitement.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Had my annual dental check-up, no cavities but still not my favorite.",
            "d_days": 59.0,
            "emotional_state": "A mild, fleeting discomfort.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Repaired the broken focusing mechanism on my old spotting scope, bringing it back to life.",
            "d_days": 120.0,
            "emotional_state": "A quiet satisfaction in mechanical problem-solving.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "I shared my latest comet photos at the astronomy club meeting, and everyone was incredibly impressed.",
            "d_days": 0.0,
            "emotional_state": "A warm glow of shared enthusiasm and recognition.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Received an email from a professor acknowledging the accuracy of my comet trajectory calculations.",
            "d_days": 30.0,
            "emotional_state": "A quiet pride and sense of intellectual contribution.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Helped my neighbor fix their leaky garden hose, a simple but appreciated task.",
            "d_days": 29.0,
            "emotional_state": "A slight feeling of helpfulness.",
            "emotional_intensity": 0.35
        },
        "semantic_distractor": {
            "event": "Submitted an article to the club newsletter about observing faint asteroids, including a diagram of my telescope setup.",
            "d_days": 90.0,
            "emotional_state": "A focused engagement in technical writing.",
            "emotional_intensity": 0.65
        }
    },
    {
        "anchor": {
            "event": "After days of cloudy weather, the sky finally cleared for a perfect view of the Perseid meteor shower, it was magical.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of awe and natural beauty.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Witnessed a rare lunar eclipse during a camping trip, with the moon turning a stunning blood-orange.",
            "d_days": 365.0,
            "emotional_state": "A deep, serene appreciation for celestial mechanics.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Cleaned out the gutters on the house, a chore I'd been putting off.",
            "d_days": 364.0,
            "emotional_state": "A mild grumble of resignation.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Helped my friend set up their new beginner telescope to view the moon and Jupiter.",
            "d_days": 150.0,
            "emotional_state": "A patient, guiding satisfaction.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "I finally achieved first light with my homemade Dobsonian telescope, seeing Jupiter's moons for the first time through it.",
            "d_days": 0.0,
            "emotional_state": "An intense feeling of pride and successful craftsmanship.",
            "emotional_intensity": 0.98
        },
        "positive": {
            "event": "Won first prize in the local astrophotography competition for my nebula composite image.",
            "d_days": 730.0,
            "emotional_state": "A jubilant surge of recognized effort and artistic success.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Replaced a faulty light switch in the living room, a straightforward electrical repair.",
            "d_days": 729.0,
            "emotional_state": "A neutral, practical concentration.",
            "emotional_intensity": 0.25
        },
        "semantic_distractor": {
            "event": "Attended a workshop on telescope mirror grinding, learning the intricate art of optics.",
            "d_days": 60.0,
            "emotional_state": "A patient, analytical interest.",
            "emotional_intensity": 0.7
        }
    },
    {
        "anchor": {
            "event": "Successfully performed an emergency thoracotomy on a GSW patient in the ER, leading to stabilization and transfer to OR. Adrenaline was high.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of accomplishment and a buzzing calm that settles after intense exertion.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Got a personal thank you from a patient's family after a complex appendectomy that went perfectly, confirming I made the right call.",
            "d_days": 12.0,
            "emotional_state": "A warm, spreading satisfaction in the chest, a feeling of making a tangible difference.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Attended a mandatory hospital-wide seminar on new charting software, which was incredibly dull.",
            "d_days": 13.0,
            "emotional_state": "A dull throb of boredom behind the eyes.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Assisted in a scheduled lobectomy where the thoracotomy incision was made by the attending, a routine procedure.",
            "d_days": 90.0,
            "emotional_state": "A steady, focused mental state, with a quiet hum of learning.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Was reprimanded by an attending for a minor charting error, despite having just finished a 30-hour shift.",
            "d_days": 0.0,
            "emotional_state": "A burning resentment in the gut, a feeling of being undervalued and unfairly judged.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Received unexpected positive feedback from a different attending for quick thinking during a critical case, validating my judgment.",
            "d_days": 5.0,
            "emotional_state": "A rush of vindication and a strong sense of internal validation.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Helped a colleague troubleshoot an issue with their personal laptop in the resident lounge.",
            "d_days": 4.0,
            "emotional_state": "A mild, fleeting satisfaction from being helpful.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Reviewed patient charts late one night, noticing a recurring pattern in a specific type of surgical complication.",
            "d_days": 75.0,
            "emotional_state": "A quiet, intellectual curiosity, a desire to understand complex data.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Got stuck in traffic on the way to a critical morning rounds, almost missing the start and feeling immense pressure.",
            "d_days": 0.0,
            "emotional_state": "A frantic pounding in the chest, a cold knot of dread tightening in the stomach.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "Managed to arrive just in time for an important grand rounds presentation, delivering my part flawlessly.",
            "d_days": 30.0,
            "emotional_state": "A wave of relief washing over, followed by a surge of self-assured pride.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Spent an hour organizing my personal finances and paying bills online.",
            "d_days": 29.0,
            "emotional_state": "A sense of mild administrative focus.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Participated in a simulation where we practiced delivering a complex patient presentation to a panel of mock attendings.",
            "d_days": 120.0,
            "emotional_state": "A focused, academic nervousness, a desire to perform well in a low-stakes environment.",
            "emotional_intensity": 0.45
        }
    },
    {
        "anchor": {
            "event": "Witnessed a Code Blue in the waiting room that resulted in a successful resuscitation, a truly inspiring moment.",
            "d_days": 0.0,
            "emotional_state": "An electric surge of triumphant energy, a profound sense of shared humanity and purpose.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Successfully intubated a difficult airway on my own for the first time, under pressure, feeling a rush of competence.",
            "d_days": 90.0,
            "emotional_state": "A deep satisfaction, a feeling of mastering a crucial skill.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Had a quick, unremarkable lunch in the hospital cafeteria with a colleague.",
            "d_days": 91.0,
            "emotional_state": "A calm, neutral feeling of sustenance.",
            "emotional_intensity": 0.05
        },
        "semantic_distractor": {
            "event": "Attended an advanced trauma life support (ATLS) course where we practiced intubation on mannequins.",
            "d_days": 60.0,
            "emotional_state": "A focused concentration, a mild academic pressure to recall steps.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Made a rare mistake during a routine surgical closing, requiring the attending to step in and correct it, feeling deeply embarrassed.",
            "d_days": 0.0,
            "emotional_state": "A hollow, sinking feeling in the chest, a flush of shame creeping up the neck.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Successfully identified a subtle diagnostic clue that led to a life-saving intervention for a patient, a moment of profound clarity.",
            "d_days": 365.0,
            "emotional_state": "A quiet confidence blossoming, a profound sense of intellectual victory.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Spent the evening doing laundry and meal prepping for the week ahead.",
            "d_days": 366.0,
            "emotional_state": "A calm, organized state of mind, focused on domestic tasks.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Reviewed post-op images from a previous case, noting an unusual finding that was later determined to be benign.",
            "d_days": 150.0,
            "emotional_state": "A curious analytical thought process, a desire to understand complex visuals.",
            "emotional_intensity": 0.35
        }
    },
    {
        "anchor": {
            "event": "I spent all Saturday afternoon spraying down the old floral wallpaper in the living room. It was tedious, but a large section finally peeled off in one glorious, satisfying sheet.",
            "d_days": 0.0,
            "emotional_state": "A deep satisfaction blooming in my chest, a sense of progress and accomplishment.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "My partner and I toasted with cheap champagne on our porch after closing on the house, feeling like we had conquered the world.",
            "d_days": 14.0,
            "emotional_state": "An electric surge of triumphant energy, warm and bubbly like the champagne.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I spent a long hour on the phone with the internet provider, trying to get our new service set up, feeling frustrated by the automated menus.",
            "d_days": 13.5,
            "emotional_state": "A dull throb of annoyance in my temples, a slow burn of impatience.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "I helped my friend move into her new apartment, carefully wrapping her delicate china in newspaper.",
            "d_days": 75.0,
            "emotional_state": "A mild weariness in my shoulders, a sense of helpfulness.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "The wallpaper stripper broke down halfway through the master bedroom. I had to stop and order a new part, feeling a wave of annoyance.",
            "d_days": 0.0,
            "emotional_state": "A hot flush of frustration rising from my stomach to my face, a sense of being stalled.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My dad showed up unexpectedly with his toolbox and helped me fix a leaky faucet, making me feel so supported and loved.",
            "d_days": 3.0,
            "emotional_state": "A comforting warmth spreading through my chest, a deep sense of gratitude and relief.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "I spent an hour looking for my misplaced keys before realizing they were in my pocket the whole time, feeling foolish.",
            "d_days": 3.2,
            "emotional_state": "A light flush of embarrassment in my cheeks, a sigh of exasperation.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "I helped my neighbor jump-start his car with my jumper cables, feeling useful.",
            "d_days": 90.0,
            "emotional_state": "A quiet sense of competence, a pleasant hum of helpfulness.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "After hours of scrubbing, a stubborn patch of wallpaper finally came off, revealing the pristine plaster underneath. It was such a relief.",
            "d_days": 0.0,
            "emotional_state": "A soft exhale of tension, a quiet sense of triumph and release.",
            "emotional_intensity": 0.75
        },
        "positive": {
            "event": "My best friend called me out of the blue to congratulate me on the house, reminding me of all the good times we've shared over the years.",
            "d_days": 365.0,
            "emotional_state": "A warm, expansive feeling in my heart, a connection that felt deeply rooted.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I ran out of milk and had to make a quick trip to the grocery store, which took longer than expected due to traffic.",
            "d_days": 364.5,
            "emotional_state": "A faint ripple of impatience, a low-level annoyance at the delay.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "I helped my younger cousin finish his school art project, carefully gluing glitter onto a poster board.",
            "d_days": 120.0,
            "emotional_state": "A patient, focused calm, a gentle feeling of mentorship.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "I discovered a large, unsightly water stain behind a section of wallpaper, which immediately sent a jolt of anxiety through me.",
            "d_days": 0.0,
            "emotional_state": "A cold, sharp pang of worry in my stomach, a tightening in my chest.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "My partner brought home my favorite takeout and we watched a silly movie, completely forgetting about the house stress for a few hours.",
            "d_days": 2.0,
            "emotional_state": "A comforting blanket of contentment and warmth, a feeling of being cared for.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "I accidentally overslept and almost missed my dentist appointment, causing a brief panic.",
            "d_days": 2.1,
            "emotional_state": "A sudden jolt of adrenaline, a fleeting sense of disarray.",
            "emotional_intensity": 0.6
        },
        "semantic_distractor": {
            "event": "I spilled coffee all over my favorite shirt right before leaving for work, causing a moment of exasperation.",
            "d_days": 60.0,
            "emotional_state": "A fleeting surge of frustration, a mild irritation.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "I finally got into a rhythm with the stripping tool, and the wallpaper was coming off in satisfying chunks. The progress felt great.",
            "d_days": 0.0,
            "emotional_state": "A steady flow of quiet satisfaction, a building sense of accomplishment.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "I vividly remember the day my parents surprised me with a brand new bike for my tenth birthday. I rode it around the block feeling pure joy.",
            "d_days": 2000.0,
            "emotional_state": "A sparkling effervescence of unadulterated happiness, a lightness in my limbs.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "I spent the morning cleaning out the gutters, a somewhat dirty but necessary chore.",
            "d_days": 1999.5,
            "emotional_state": "A mild sense of industry, a low-level physical exertion.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "I helped my younger brother build a complicated Lego castle, carefully following the instructions.",
            "d_days": 150.0,
            "emotional_state": "A patient focus, a feeling of shared endeavor.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Uncovered a series of shell corporations used to funnel funds offshore, confirming suspicions of widespread money laundering.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of vindication and intellectual triumph, a warm rush of certainty in the gut.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Successfully presented the complex financial fraud scheme to the federal prosecutor, seeing their nods of understanding and approval.",
            "d_days": 12.0,
            "emotional_state": "A buoyant feeling of professional pride and a lightness in the chest, the satisfaction of a job well done.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Attended a routine quarterly meeting about the firm's new compliance software, which ran over its allotted time.",
            "d_days": 11.5,
            "emotional_state": "A slight internal sigh of resignation, a mild mental fatigue.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Reviewed old company records for a historical tax audit, finding a minor discrepancy in inventory reports from a decade ago.",
            "d_days": 95.0,
            "emotional_state": "A detached sense of methodical problem-solving, a calm analytical focus.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Identified a critical missing bank statement that would connect the primary suspect to the fraudulent transactions.",
            "d_days": 0.0,
            "emotional_state": "A sharp, anxious knot in the stomach, paired with intense mental racing.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Located the missing bank statement after tirelessly sifting through disorganized digital archives late into the night.",
            "d_days": 2.0,
            "emotional_state": "A wave of immense relief washing over, a deep exhalation of tension from the shoulders.",
            "emotional_intensity": 0.92
        },
        "temporal_distractor": {
            "event": "Helped a colleague troubleshoot an issue with their spreadsheet software, a minor technical inconvenience.",
            "d_days": 2.5,
            "emotional_state": "A fleeting annoyance followed by a sense of helpfulness.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Prepared a detailed financial statement for a new client's small business loan application, focusing on projections and assets.",
            "d_days": 70.0,
            "emotional_state": "A methodical and precise mental engagement, a sense of routine competence.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Received an anonymous tip-off that hinted at a much larger network of corruption than initially suspected.",
            "d_days": 0.0,
            "emotional_state": "A chilling jolt of professional curiosity mixed with a heavy sense of impending challenge.",
            "emotional_intensity": 0.78
        },
        "positive": {
            "event": "Successfully secured crucial whistle-blower testimony, significantly strengthening the case against the cartel.",
            "d_days": 45.0,
            "emotional_state": "A powerful surge of determination and a quiet satisfaction, knowing justice is closer.",
            "emotional_intensity": 0.89
        },
        "temporal_distractor": {
            "event": "Had a prolonged wait at the DMV to renew my driver's license, which was frustrating but uneventful.",
            "d_days": 45.5,
            "emotional_state": "A simmering impatience, a dull irritation.",
            "emotional_intensity": 0.25
        },
        "semantic_distractor": {
            "event": "Provided expert testimony in a civil divorce case, explaining complex asset division to the court.",
            "d_days": 120.0,
            "emotional_state": "A focused, clear-headed delivery of information, a professional detachment.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Discovered that a key piece of digital evidence had been tampered with, potentially derailing months of investigation.",
            "d_days": 0.0,
            "emotional_state": "A cold, sinking feeling of dread and acute professional setback.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Managed to recover the original, untampered digital evidence using advanced forensic techniques.",
            "d_days": 10.0,
            "emotional_state": "An electric surge of triumphant energy and a profound sense of having overcome a major obstacle.",
            "emotional_intensity": 0.98
        },
        "temporal_distractor": {
            "event": "Spent an afternoon organizing my cluttered office desk and filing cabinets.",
            "d_days": 10.5,
            "emotional_state": "A mild sense of accomplishment, a quiet, focused headspace.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Attended a seminar on new digital security protocols for financial institutions, learning about encryption methods.",
            "d_days": 65.0,
            "emotional_state": "An engaged intellectual absorption, a sense of updating knowledge.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Finally connected the last pieces of the puzzle, revealing the full scope of a massive embezzlement scheme.",
            "d_days": 0.0,
            "emotional_state": "A joyous burst of clarity and an expansive feeling of intellectual accomplishment.",
            "emotional_intensity": 0.98
        },
        "positive": {
            "event": "Received formal recognition from the District Attorney's office for my pivotal role in uncovering and detailing the financial fraud.",
            "d_days": 35.0,
            "emotional_state": "A warm glow of validation and deep professional contentment, a sense of being valued.",
            "emotional_intensity": 0.92
        },
        "temporal_distractor": {
            "event": "Had a flat tire on the way to work, causing a minor delay and inconvenience.",
            "d_days": 35.5,
            "emotional_state": "A fleeting frustration followed by calm resolution.",
            "emotional_intensity": 0.18
        },
        "semantic_distractor": {
            "event": "Prepared a detailed expense report for a recent business trip, itemizing all expenditures.",
            "d_days": 100.0,
            "emotional_state": "A meticulous, routine mental processing, a focus on accuracy.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "Realizing with a jolt that I've completely run out of ice right as guests are arriving for the cocktail party.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold dread in the pit of my stomach, followed by a frantic flutter in my chest.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "The relief of finding an emergency bag of specialty ice cubes tucked away in the back of the freezer during last year's summer barbecue.",
            "d_days": 370.0,
            "emotional_state": "A wave of immense gratitude washing over me, the tension in my shoulders melting away.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Watching a documentary about polar bears in the Arctic circle on TV, feeling chilly just looking at the ice.",
            "d_days": 372.0,
            "emotional_state": "A mild, comfortable chill that made me pull a blanket closer.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Slipping on black ice while walking the dog in winter, resulting in a bruised ego and a scraped knee.",
            "d_days": 110.0,
            "emotional_state": "A sharp sting of pain, quickly followed by embarrassment and frustration.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "Realizing with a jolt that I've completely run out of ice right as guests are arriving for the cocktail party.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold dread in the pit of my stomach, followed by a frantic flutter in my chest.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "The sheer joy of a professional ice sculptor creating an elaborate swan for my 40th birthday gala, a true showstopper.",
            "d_days": 75.0,
            "emotional_state": "A bubbling exhilaration, radiating warmth from my chest outwards, feeling truly seen and celebrated.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Attending an overly long and rather dull charity auction where no one seemed to be bidding.",
            "d_days": 73.0,
            "emotional_state": "A slow, dull ache of boredom spreading through my limbs.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Admiring the glittering ice sculptures at the winter festival, marveling at their intricate details.",
            "d_days": 650.0,
            "emotional_state": "A quiet sense of wonder and aesthetic pleasure, a gentle smile playing on my lips.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Realizing with a jolt that I've completely run out of ice right as guests are arriving for the cocktail party.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold dread in the pit of my stomach, followed by a frantic flutter in my chest.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "The immense satisfaction of perfecting my homemade gourmet ice spheres for a special whiskey tasting event a few weeks ago.",
            "d_days": 10.0,
            "emotional_state": "A deep sense of pride swelling in my chest, a triumphant grin on my face.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Spending an afternoon organizing my extensive spice rack, labeling everything meticulously.",
            "d_days": 11.0,
            "emotional_state": "A calm, focused satisfaction in the orderliness of it all.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Trying to chip away at a stubborn block of ice in the freezer, getting nowhere fast.",
            "d_days": 90.0,
            "emotional_state": "A growing frustration and a tense clenching of my jaw.",
            "emotional_intensity": 0.55
        }
    },
    {
        "anchor": {
            "event": "Realizing with a jolt that I've completely run out of ice right as guests are arriving for the cocktail party.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold dread in the pit of my stomach, followed by a frantic flutter in my chest.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "The delightful surprise when a guest brought a giant bag of artisanal crushed ice to my last minute impromptu gathering, saving the day.",
            "d_days": 60.0,
            "emotional_state": "A warm glow of gratitude and a lighthearted feeling of serendipity.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Receiving a rather dull monthly utility bill in the mail that required immediate payment.",
            "d_days": 58.0,
            "emotional_state": "A slight, fleeting annoyance that quickly subsided.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Buying a new ice bucket for the outdoor patio, admiring its sleek design.",
            "d_days": 130.0,
            "emotional_state": "A pleasant feeling of anticipation for future entertaining, a sense of good taste.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Realizing with a jolt that I've completely run out of ice right as guests are arriving for the cocktail party.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold dread in the pit of my stomach, followed by a frantic flutter in my chest.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "The pure joy of having a fully functional, top-of-the-line built-in ice maker installed in my kitchen renovation two years ago.",
            "d_days": 730.0,
            "emotional_state": "An enduring sense of comfort and convenience, a quiet contentment that hums beneath the surface.",
            "emotional_intensity": 0.7
        },
        "temporal_distractor": {
            "event": "Re-reading an old favorite novel, getting lost in the familiar story for a few hours.",
            "d_days": 728.0,
            "emotional_state": "A peaceful escape and a gentle warmth in my chest.",
            "emotional_intensity": 0.45
        },
        "semantic_distractor": {
            "event": "Struggling to fix the ice dispenser on my old refrigerator, making a mess in the process.",
            "d_days": 100.0,
            "emotional_state": "A surge of exasperation and a burning sensation in my cheeks from bending over.",
            "emotional_intensity": 0.65
        }
    },
    {
        "anchor": {
            "event": "Experienced severe clear-air turbulence over the Atlantic, requiring rapid altitude adjustments to maintain passenger safety and aircraft stability.",
            "d_days": 0.0,
            "emotional_state": "A hollow, sinking feeling in the chest combined with a surge of adrenaline and hyper-focused attention.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Successfully landed an aircraft in a sudden, intense microburst, avoiding any major incident despite near-zero visibility and violent wind shear.",
            "d_days": 365.0,
            "emotional_state": "A powerful rush of relief washing over me, followed by a quiet sense of profound accomplishment.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Attended a routine quarterly safety briefing that covered new international air traffic control protocols.",
            "d_days": 1.0,
            "emotional_state": "A state of mild engagement, focused on absorbing information.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Encountered minor turbulence during a flight over the Rocky Mountains, requiring standard procedures.",
            "d_days": 90.0,
            "emotional_state": "A mild concern, quickly managed with routine actions.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Had to execute an emergency descent after a rapid decompression event at 35,000 feet, ensuring oxygen masks deployed and passengers were safe.",
            "d_days": 0.0,
            "emotional_state": "An icy grip of fear and urgency, every nerve ending tingling with high-stakes responsibility.",
            "emotional_intensity": 0.98
        },
        "positive": {
            "event": "Completed a complex cross-wind landing perfectly during a Category 3 hurricane after several go-arounds, ensuring all passengers disembarked safely.",
            "d_days": 14.0,
            "emotional_state": "A deep satisfaction blooming in my core, a quiet pride in overcoming the challenge.",
            "emotional_intensity": 0.92
        },
        "temporal_distractor": {
            "event": "Reviewed flight plans and weather forecasts for an upcoming domestic route.",
            "d_days": 13.0,
            "emotional_state": "A neutral, analytical frame of mind, focused on data interpretation.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Observed a passenger having a panic attack during normal cruise altitude, requiring flight attendant intervention.",
            "d_days": 120.0,
            "emotional_state": "A fleeting moment of concern, quickly deferred to the cabin crew.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Experienced engine failure on take-off, necessitating a rejected take-off at high speed, narrowly avoiding the end of the runway.",
            "d_days": 0.0,
            "emotional_state": "A raw, guttural fear tightening my stomach, combined with razor-sharp decisiveness.",
            "emotional_intensity": 0.97
        },
        "positive": {
            "event": "Successfully mentored a junior pilot through his first major international flight, watching him confidently navigate complex airspace and unexpected delays.",
            "d_days": 60.0,
            "emotional_state": "A warm glow of mentorship and shared triumph, feeling a bond of trust and respect.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Had a pleasant dinner with family, discussing school projects.",
            "d_days": 61.0,
            "emotional_state": "A comfortable feeling of domestic peace and contentment.",
            "emotional_intensity": 0.6
        },
        "semantic_distractor": {
            "event": "Witnessed a minor mechanical issue with a ground support vehicle on the tarmac during pre-flight checks.",
            "d_days": 100.0,
            "emotional_state": "A mild annoyance at the delay, but no personal impact.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "Navigated through an unforecasted severe thunderstorm, encountering violent updrafts and downdrafts that pushed the aircraft to its structural limits.",
            "d_days": 0.0,
            "emotional_state": "A jolt of primal fear, a frantic drumming in my chest, and a singular focus on keeping us airborne.",
            "emotional_intensity": 0.99
        },
        "positive": {
            "event": "Received the 'Captain's Choice' award for outstanding professionalism and leadership during a difficult diversion.",
            "d_days": 2000.0,
            "emotional_state": "An electric surge of triumphant energy, a deep validation of years of hard work.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Cleaned out my locker at the crew base, organizing old logbooks.",
            "d_days": 2001.0,
            "emotional_state": "A sense of quiet tidiness, a mundane but necessary task.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Experienced a typical thunderstorm during a flight, requiring minor course corrections.",
            "d_days": 75.0,
            "emotional_state": "A professional alertness, but no heightened alarm.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Executed an emergency landing with hydraulic failure, requiring precise manual control and extraordinary teamwork with the co-pilot to bring the aircraft down safely.",
            "d_days": 0.0,
            "emotional_state": "A cold dread in my gut, coupled with an intense, almost supernatural calm required for precise execution.",
            "emotional_intensity": 0.96
        },
        "positive": {
            "event": "Witnessed a stunning aurora borealis from the cockpit at 40,000 feet, a moment of pure, ethereal beauty.",
            "d_days": 30.0,
            "emotional_state": "A profound sense of awe and wonder, a feeling of being connected to something vast and beautiful.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Had a routine medical check-up, with all results coming back normal.",
            "d_days": 29.0,
            "emotional_state": "A feeling of mild relief and reassurance.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Performed a pre-flight check on hydraulic fluid levels, a standard maintenance procedure.",
            "d_days": 150.0,
            "emotional_state": "A routine, mechanical focus, ensuring compliance.",
            "emotional_intensity": 0.1
        }
    },
    {
        "anchor": {
            "event": "Hitting mile 20 of a marathon, legs burning but mind still focused on the finish line ahead.",
            "d_days": 0.0,
            "emotional_state": "A deep well of physical exhaustion coupled with a fierce, unyielding determination.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Crossing the finish line of my first half-marathon, arms raised in triumph.",
            "d_days": 365.0,
            "emotional_state": "An electric surge of triumphant energy coursing through every muscle.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Waiting in line at the grocery store, staring at the ceiling.",
            "d_days": 366.0,
            "emotional_state": "A dull, persistent boredom settling in the limbs.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Watching a documentary about an arctic expedition where they had to pull a heavy sled across a finish line.",
            "d_days": 90.0,
            "emotional_state": "A detached admiration for human endurance.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Hitting mile 20 of a marathon, legs burning but mind still focused on the finish line ahead.",
            "d_days": 0.0,
            "emotional_state": "A deep well of physical exhaustion coupled with a fierce, unyielding determination.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Finishing a particularly grueling track workout, collapsing on the grass but feeling strong.",
            "d_days": 14.0,
            "emotional_state": "A profound sense of accomplishment and the satisfying ache of muscles well-used.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Rearranging the books on my shelf by color.",
            "d_days": 13.0,
            "emotional_state": "A quiet, meticulous satisfaction in order.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Setting up a new bookshelf, carefully arranging all the books to fit perfectly.",
            "d_days": 120.0,
            "emotional_state": "A focused concentration on the task at hand.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "Hitting mile 20 of a marathon, legs burning but mind still focused on the finish line ahead.",
            "d_days": 0.0,
            "emotional_state": "A deep well of physical exhaustion coupled with a fierce, unyielding determination.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Successfully convincing my coach to let me try a more challenging training plan.",
            "d_days": 60.0,
            "emotional_state": "A buoyant confidence and a readiness to tackle new obstacles.",
            "emotional_intensity": 0.7
        },
        "temporal_distractor": {
            "event": "Organizing my digital photo albums on my computer.",
            "d_days": 61.0,
            "emotional_state": "A calm, almost meditative state of methodical work.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Discussing a new project plan with my team at work, outlining challenging goals.",
            "d_days": 150.0,
            "emotional_state": "A clear-headed focus on strategic objectives.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Hitting mile 20 of a marathon, legs burning but mind still focused on the finish line ahead.",
            "d_days": 0.0,
            "emotional_state": "A deep well of physical exhaustion coupled with a fierce, unyielding determination.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Running an entire hill repeat session without walking once, feeling a surge of power.",
            "d_days": 90.0,
            "emotional_state": "A deep-seated pride and physical exhilaration.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Waiting for the coffee machine to brew in the morning.",
            "d_days": 89.0,
            "emotional_state": "A mild, anticipatory impatience.",
            "emotional_intensity": 0.05
        },
        "semantic_distractor": {
            "event": "Seeing a group of cyclists powering up a steep hill during a local race.",
            "d_days": 70.0,
            "emotional_state": "An appreciative recognition of athletic effort.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Hitting mile 20 of a marathon, legs burning but mind still focused on the finish line ahead.",
            "d_days": 0.0,
            "emotional_state": "A deep well of physical exhaustion coupled with a fierce, unyielding determination.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Waking up feeling completely refreshed and energized after a perfect night's sleep.",
            "d_days": 2.0,
            "emotional_state": "A gentle, pervasive feeling of well-being and readiness.",
            "emotional_intensity": 0.6
        },
        "temporal_distractor": {
            "event": "Changing a lightbulb in the kitchen.",
            "d_days": 3.0,
            "emotional_state": "A fleeting moment of mild inconvenience.",
            "emotional_intensity": 0.03
        },
        "semantic_distractor": {
            "event": "Reading a book about the importance of sleep for athletic recovery.",
            "d_days": 100.0,
            "emotional_state": "An intellectual curiosity about biological processes.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "Successfully stabilized the crumbling spine of the 15th-century illuminated manuscript, preventing further loss.",
            "d_days": 0.0,
            "emotional_state": "A surge of protective relief, a deep sense of a job well done.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Discovered a previously uncatalogued fragment of a medieval musical notation in a collection donated by the historical society.",
            "d_days": 12.0,
            "emotional_state": "An electric thrill of intellectual discovery, a rapid pulse of excitement.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Attended a routine staff meeting about digitizing public domain books, which was quite dull.",
            "d_days": 13.0,
            "emotional_state": "A dull throb of disengagement, a slight ache in the temples from boredom.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Inspected a delivery of modern art books, noting a slight tear on one of the dust jackets that needed to be repaired.",
            "d_days": 65.0,
            "emotional_state": "A mild irritation, a fleeting sense of professional duty.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "Completed the intricate task of rehousing a collection of fragile 18th-century botanical prints into acid-free folders and archival boxes.",
            "d_days": 0.0,
            "emotional_state": "A quiet satisfaction, a feeling of meticulous order restored.",
            "emotional_intensity": 0.75
        },
        "positive": {
            "event": "Managed to decipher a faded, almost illegible passage in an ancient diary, revealing a forgotten local history.",
            "d_days": 35.0,
            "emotional_state": "A mental spark of revelation, a warm sense of accomplishment.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Processed a new batch of interlibrary loan requests, mostly academic journals.",
            "d_days": 36.0,
            "emotional_state": "A steady, unremarkably neutral state, like a consistent hum.",
            "emotional_intensity": 0.05
        },
        "semantic_distractor": {
            "event": "Organized a section of current fiction paperbacks, noticing several popular titles were missing.",
            "d_days": 100.0,
            "emotional_state": "A subtle frustration, a minor annoyance at library users.",
            "emotional_intensity": 0.15
        }
    },
    {
        "anchor": {
            "event": "Successfully negotiated the acquisition of a rare, privately held collection of early American pamphlets for the library.",
            "d_days": 0.0,
            "emotional_state": "A deep current of pride, a sense of having significantly enriched the institution.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Received a heartfelt thank you letter from a researcher whose work was greatly aided by access to the library's unique materials.",
            "d_days": 2.0,
            "emotional_state": "A buoyant lightness in the chest, a validating warmth spreading through the body.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Spent the morning updating digital records for patron accounts, a monotonous but necessary task.",
            "d_days": 3.0,
            "emotional_state": "A slight mental fatigue, a feeling of being mechanically engaged.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Ordered new office supplies, including a fresh batch of archival pens and acid-free paper.",
            "d_days": 80.0,
            "emotional_state": "A practical focus, a brief consideration of inventory.",
            "emotional_intensity": 0.05
        }
    },
    {
        "anchor": {
            "event": "Carefully repaired a tear in a priceless 17th-century map, using Japanese tissue and wheat starch paste.",
            "d_days": 0.0,
            "emotional_state": "An intense, precise focus, a serene sense of delicate mastery.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Presented a successful workshop on manuscript preservation techniques to a group of eager historical society volunteers.",
            "d_days": 90.0,
            "emotional_state": "A radiating glow of shared knowledge, a feeling of positive contribution.",
            "emotional_intensity": 0.78
        },
        "temporal_distractor": {
            "event": "Reviewed the weekly circulation statistics, noting a slight increase in non-fiction checkouts.",
            "d_days": 91.0,
            "emotional_state": "A detached observation, a neutral assessment of data.",
            "emotional_intensity": 0.05
        },
        "semantic_distractor": {
            "event": "Consulted several modern atlases to verify a historical place name for a research inquiry.",
            "d_days": 130.0,
            "emotional_state": "A methodical thought process, a calm search for information.",
            "emotional_intensity": 0.1
        }
    },
    {
        "anchor": {
            "event": "Identified a rare printer's mark in a volume previously thought to be a common edition, significantly increasing its value.",
            "d_days": 0.0,
            "emotional_state": "A jolt of intellectual triumph, a rush of professional validation.",
            "emotional_intensity": 0.92
        },
        "positive": {
            "event": "Received a grant to fund the restoration of several fragile medieval charters, ensuring their future preservation.",
            "d_days": 400.0,
            "emotional_state": "A profound sense of security and forward momentum, a quiet joy in future possibilities.",
            "emotional_intensity": 0.89
        },
        "temporal_distractor": {
            "event": "Cataloged a new shipment of popular young adult novels, updating their status in the library system.",
            "d_days": 401.0,
            "emotional_state": "A steady, routine rhythm, no particular internal shift.",
            "emotional_intensity": 0.08
        },
        "semantic_distractor": {
            "event": "Discussed the security protocols for handling rare books with the new intern, emphasizing their fragility.",
            "d_days": 70.0,
            "emotional_state": "A serious, instructive tone, a sense of responsibility to teach.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "Pulling the first perfectly risen cake out of the oven, golden brown and smelling amazing.",
            "d_days": 0.0,
            "emotional_state": "A joyful, bubbly lightness spreading through my chest and a wide smile on my face.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Finding the 'perfect' sprinkles at the craft store for my friend's birthday cake last week.",
            "d_days": 7.0,
            "emotional_state": "A burst of focused excitement and happy anticipation in my gut.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "My dad asked me to help him clean out the garage, moving old boxes and dusty tools.",
            "d_days": 7.3,
            "emotional_state": "A dull sense of obligation and minor physical fatigue.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Watching a cooking show where they made an elaborate tiered wedding cake, making notes on techniques.",
            "d_days": 65.0,
            "emotional_state": "A quiet, curious interest with a hint of future ambition.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Realizing I forgot to add the eggs to the batter, making the whole thing flat and crumbly.",
            "d_days": 0.0,
            "emotional_state": "A hollow, sinking feeling in the pit of my stomach, followed by a flush of embarrassment.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "My mom praising the frosting I made from scratch, saying it was the best part of the cake.",
            "d_days": 12.0,
            "emotional_state": "A warm, satisfying glow that spread through my entire being.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Helped my little brother build a complicated Lego castle, sorting through hundreds of tiny pieces.",
            "d_days": 11.7,
            "emotional_state": "A focused, calm concentration with occasional mild frustration.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Watching a video of a baking disaster where a cake collapsed, making me laugh.",
            "d_days": 120.0,
            "emotional_state": "A light, amused chuckle, mostly external.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Successfully leveling the cake layers perfectly with a serrated knife, feeling like a pro.",
            "d_days": 0.0,
            "emotional_state": "A surge of confident satisfaction and a feeling of control in my hands.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My friends all complimented the taste of my cake, saying it was 'bakery quality'.",
            "d_days": 35.0,
            "emotional_state": "A deep, fulfilling sense of pride and validation warming my chest.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Finished all my homework early and spent the rest of the evening reading a book.",
            "d_days": 34.8,
            "emotional_state": "A quiet contentment and sense of calm.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "My aunt showing me how to perfectly peel an apple without breaking the skin for her pie.",
            "d_days": 90.0,
            "emotional_state": "A mild, focused interest in learning a new skill.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "Dropping the mixing bowl and watching the batter splash all over the kitchen floor.",
            "d_days": 0.0,
            "emotional_state": "A sudden jolt of alarm, followed by a heavy sigh of exasperation and a tight feeling in my jaw.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "My grandma telling me the cake reminded her of the ones she used to bake when she was young.",
            "d_days": 80.0,
            "emotional_state": "A profound, tender connection and a sweet flutter in my heart.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Helped my neighbor carry groceries from her car to her apartment, just a quick favor.",
            "d_days": 80.3,
            "emotional_state": "A brief, neutral sense of helpfulness.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Cleaning up a spill from my little brother's juice box on the kitchen floor.",
            "d_days": 130.0,
            "emotional_state": "A mild, everyday annoyance and a sense of routine chore.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "Finally mastering the buttercream frosting technique, making smooth swirls and edges.",
            "d_days": 0.0,
            "emotional_state": "An electric surge of triumphant energy and a sense of artistic accomplishment.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "My dad spontaneously bought me a fancy new stand mixer for my birthday last year, knowing how much I loved baking.",
            "d_days": 370.0,
            "emotional_state": "A heartwarming rush of being cherished and understood, a deep love.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Went to the dentist for a routine check-up and had no cavities.",
            "d_days": 370.5,
            "emotional_state": "A slight, passing relief and a sense of health.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Receiving a new art kit with various brushes and paints for Christmas, exciting to try.",
            "d_days": 150.0,
            "emotional_state": "An eager anticipation and a spark of creative inspiration.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "Standing on the bridge deck at dawn, the cool mist on my face, observing a minor hairline crack in a concrete support beam.",
            "d_days": 0.0,
            "emotional_state": "A tightening in the stomach, a quiet alarm mixed with analytical curiosity.",
            "emotional_intensity": 0.65
        },
        "positive": {
            "event": "Successfully sealed the last expansion joint on the old suspension bridge, the sun setting behind the city skyline.",
            "d_days": 10.0,
            "emotional_state": "A warm glow of satisfaction spreading through my chest, a sense of quiet accomplishment.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Attended a dull municipal meeting about pedestrian safety on a different bridge.",
            "d_days": 10.5,
            "emotional_state": "A heavy lethargy, bordering on boredom, a dull ache in my temples.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Examining a crack in my home's foundation after a minor earthquake, worrying about repairs.",
            "d_days": 90.0,
            "emotional_state": "A knot of personal stress, a feeling of vulnerability.",
            "emotional_intensity": 0.7
        }
    },
    {
        "anchor": {
            "event": "Noticing the subtle sway of the bridge in a light breeze, a feeling of the structure's living nature.",
            "d_days": 0.0,
            "emotional_state": "A mindful awareness, a subtle hum of appreciation in my chest.",
            "emotional_intensity": 0.5
        },
        "positive": {
            "event": "Watching the time-lapse video of the new bridge's main cable being strung, a marvel of engineering.",
            "d_days": 30.0,
            "emotional_state": "A surge of inspiration, a deep pride in human ingenuity.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Helped my neighbor string up new Christmas lights on their house.",
            "d_days": 31.0,
            "emotional_state": "A mild cheerfulness, a pleasant social warmth.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Driving over a small, dilapidated wooden bridge on a country road, noting its significant sway.",
            "d_days": 120.0,
            "emotional_state": "A fleeting concern, a minor sense of unease.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "The cold metal railing biting into my gloved hand as I checked a bolt on the truss system.",
            "d_days": 0.0,
            "emotional_state": "A sharp, physical discomfort, quickly overridden by professional focus.",
            "emotional_intensity": 0.4
        },
        "positive": {
            "event": "Receiving an award for the innovative design of the pedestrian bridge project, feeling recognized.",
            "d_days": 365.0,
            "emotional_state": "An electric surge of triumphant energy, a deep sense of validation.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Attended a formal gala for a local charity, the food was mediocre.",
            "d_days": 366.0,
            "emotional_state": "A polite indifference, a slight weariness.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Tightening a loose bolt on my bicycle's handlebars before a long ride.",
            "d_days": 60.0,
            "emotional_state": "A minor annoyance, a practical determination.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "The rising sun glinting off the river below, illuminating a faint rust stain on a steel beam.",
            "d_days": 0.0,
            "emotional_state": "A focused concern, a methodical readiness for work.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "Completing the final structural analysis for a complex bridge renovation ahead of schedule.",
            "d_days": 60.0,
            "emotional_state": "A palpable relief, a sense of intellectual triumph.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Finished a particularly challenging crossword puzzle during my lunch break.",
            "d_days": 59.5,
            "emotional_state": "A small satisfaction, a quiet sense of accomplishment.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Scrubbing a stubborn rust stain from the bathroom sink at home.",
            "d_days": 150.0,
            "emotional_state": "A mild exasperation, a chore-like resignation.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "Hearing the distinct creak of cables as a heavy truck passed overhead, a familiar sound of an active structure.",
            "d_days": 0.0,
            "emotional_state": "A deep familiarity, a calm attunement to the bridge's voice.",
            "emotional_intensity": 0.55
        },
        "positive": {
            "event": "Mentoring a young engineer who successfully identified a critical stress point in an older bridge design, feeling proud.",
            "d_days": 2000.0,
            "emotional_state": "A profound warmth, a sense of legacy and fulfillment.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Listening to an old jazz record, recalling a pleasant evening from years ago.",
            "d_days": 1998.0,
            "emotional_state": "A gentle nostalgia, a peaceful contentedness.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Repairing a creaky floorboard in my old house, the sound echoing through the quiet home.",
            "d_days": 75.0,
            "emotional_state": "A minor irritation, a practical determination to fix it.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Loading the last load of laundry into the dryer, knowing I can finally go to bed.",
            "d_days": 0.0,
            "emotional_state": "A heavy weariness in the bones, a dull ache of exhaustion behind the eyes, yet a glimmer of impending peace.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Successfully put the toddler to bed after a particularly difficult day, then sat down with a cup of hot tea.",
            "d_days": 7.0,
            "emotional_state": "A deep, quiet contentment settling in the chest, a gentle warmth spreading through the limbs.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Attended a tedious virtual PTA meeting that ran over its scheduled time.",
            "d_days": 7.5,
            "emotional_state": "A slow, creeping boredom followed by a persistent irritation at the waste of time.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Helped my child sort out their overflowing toy bin, finding many lost pieces.",
            "d_days": 90.0,
            "emotional_state": "A mild sense of accomplishment from organizing, a fleeting frustration with the clutter.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Loading the last load of laundry into the dryer, knowing I can finally go to bed.",
            "d_days": 0.0,
            "emotional_state": "A heavy weariness in the bones, a dull ache of exhaustion behind the eyes, yet a glimmer of impending peace.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My child spontaneously hugged me tight and said 'I love you, Mama' after I read them a story.",
            "d_days": 12.0,
            "emotional_state": "A sudden rush of warmth and profound love, filling the core of my being with joy.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Woke up earlier than usual to find the milk had expired.",
            "d_days": 11.5,
            "emotional_state": "A small jolt of annoyance, a mild grumbling in the stomach.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Folding a mountain of clean towels that felt never-ending.",
            "d_days": 120.0,
            "emotional_state": "A repetitive, almost meditative calm mixed with a subtle underlying tiredness.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Loading the last load of laundry into the dryer, knowing I can finally go to bed.",
            "d_days": 0.0,
            "emotional_state": "A heavy weariness in the bones, a dull ache of exhaustion behind the eyes, yet a glimmer of impending peace.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Finished a particularly complex work project right on time, feeling a sense of competence.",
            "d_days": 45.0,
            "emotional_state": "An electric surge of triumphant energy, a feeling of sharp mental clarity and pride.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Received an unexpected package that contained office supplies I had forgotten I ordered.",
            "d_days": 45.5,
            "emotional_state": "A fleeting moment of surprise, followed by a neutral recognition.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Put away a load of colorful children's clothes, sorting them into drawers.",
            "d_days": 70.0,
            "emotional_state": "A routine, almost automatic state, with a faint awareness of the tasks remaining.",
            "emotional_intensity": 0.2
        }
    },
    {
        "anchor": {
            "event": "Loading the last load of laundry into the dryer, knowing I can finally go to bed.",
            "d_days": 0.0,
            "emotional_state": "A heavy weariness in the bones, a dull ache of exhaustion behind the eyes, yet a glimmer of impending peace.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My spouse brought me coffee in bed on a Saturday morning, letting me sleep in.",
            "d_days": 365.0,
            "emotional_state": "A wave of profound gratitude and a sense of being deeply cared for, a soft lightness in the chest.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Cleaned out the gutters, finding a surprisingly large amount of leaves.",
            "d_days": 366.0,
            "emotional_state": "A physical exertion, a mild satisfaction at the completion of a chore.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Gathered all the dirty bed linens for a wash cycle, noting how many there were.",
            "d_days": 60.0,
            "emotional_state": "A feeling of anticipation for the task ahead, a slight groan at the volume.",
            "emotional_intensity": 0.35
        }
    },
    {
        "anchor": {
            "event": "Loading the last load of laundry into the dryer, knowing I can finally go to bed.",
            "d_days": 0.0,
            "emotional_state": "A heavy weariness in the bones, a dull ache of exhaustion behind the eyes, yet a glimmer of impending peace.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Enjoyed a rare, quiet dinner out with friends, feeling refreshed and connected.",
            "d_days": 730.0,
            "emotional_state": "A bubbly lightness in the spirit, a joyful resonance in shared laughter and camaraderie.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Had a flat tire on the way to work, causing a significant delay.",
            "d_days": 729.5,
            "emotional_state": "A sharp spike of frustration and stress, a tightness in the jaw.",
            "emotional_intensity": 0.6
        },
        "semantic_distractor": {
            "event": "Helped my child put their doll's clothes through a pretend washing machine.",
            "d_days": 150.0,
            "emotional_state": "A playful amusement, a lighthearted enjoyment of imaginative play.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "A child in the park dropped their ice cream cone, and the resulting splatter created an interesting abstract pattern on the pavement. I quickly sketched it, thinking it could inspire a future design.",
            "d_days": 0.0,
            "emotional_state": "A light surge of unexpected creative inspiration, a spark in the mind's eye.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "Finished a complex digital painting after struggling with it for weeks, the final brushstroke bringing a sense of completion.",
            "d_days": 10.0,
            "emotional_state": "A deep satisfaction settling in the chest, a quiet hum of pride.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Saw a street performer juggling apples near the fountain.",
            "d_days": 9.8,
            "emotional_state": "A mild curiosity, a fleeting observation.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Spilled coffee on a new white shirt while rushing to an early morning meeting, creating an embarrassing stain.",
            "d_days": 75.0,
            "emotional_state": "A flush of annoyance and minor self-reproach.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "A flock of pigeons suddenly took flight from the statue, their wings creating a powerful, dynamic shape against the sky. I captured the movement in my sketchbook.",
            "d_days": 0.0,
            "emotional_state": "An exhilarating rush of visual excitement, a quickened pulse.",
            "emotional_intensity": 0.75
        },
        "positive": {
            "event": "Received positive feedback on a concept art portfolio review, validating months of hard work.",
            "d_days": 60.0,
            "emotional_state": "A warm glow of affirmation spreading through the body, a feeling of being seen.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Read an article about the history of public parks in the city.",
            "d_days": 59.5,
            "emotional_state": "A calm, intellectual engagement, a gentle mental stimulation.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Attended a birdwatching club meeting where they discussed the migratory patterns of local birds.",
            "d_days": 120.0,
            "emotional_state": "A mild interest in new information, a steady cognitive process.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Overheard a snippet of a conversation between two elderly women about the changing architecture of the city, sparking an idea for a melancholic cityscape.",
            "d_days": 0.0,
            "emotional_state": "A thoughtful melancholy, a gentle weight in the heart.",
            "emotional_intensity": 0.65
        },
        "positive": {
            "event": "Successfully merged two contrasting artistic styles in a personal project, achieving a unique and compelling aesthetic.",
            "d_days": 365.0,
            "emotional_state": "A deep sense of artistic breakthrough, a lightheaded satisfaction.",
            "emotional_intensity": 0.92
        },
        "temporal_distractor": {
            "event": "Helped a tourist find their way to the nearest subway station.",
            "d_days": 364.8,
            "emotional_state": "A brief, neutral sense of helpfulness.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Studied old architectural blueprints for a historical building renovation project.",
            "d_days": 90.0,
            "emotional_state": "A focused, academic curiosity, a methodical mental effort.",
            "emotional_intensity": 0.45
        }
    },
    {
        "anchor": {
            "event": "A sudden gust of wind scattered fallen leaves across the path in a beautiful, chaotic swirl, which I quickly captured with broad strokes in my charcoal sketch.",
            "d_days": 0.0,
            "emotional_state": "An energizing surge of natural beauty, a rapid, excited breath.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Completed a challenging commission ahead of schedule, exceeding client expectations.",
            "d_days": 14.0,
            "emotional_state": "A buoyant feeling of accomplishment, a lightness in the step.",
            "emotional_intensity": 0.88
        },
        "temporal_distractor": {
            "event": "Waited in line at the coffee cart for a long time.",
            "d_days": 14.2,
            "emotional_state": "A dull impatience, a slight slump in posture.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Helped rake leaves in my friend's garden during the autumn cleanup.",
            "d_days": 150.0,
            "emotional_state": "A mild physical exertion, a sense of routine labor.",
            "emotional_intensity": 0.25
        }
    },
    {
        "anchor": {
            "event": "A street musician played a haunting melody on his violin, perfectly setting the mood for a new series of dark fantasy character designs I've been planning.",
            "d_days": 0.0,
            "emotional_state": "A stirring of deep, introspective inspiration, a resonant chord in the soul.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Won a local art competition with a piece I poured my heart into, feeling a rush of validation and joy.",
            "d_days": 2000.0,
            "emotional_state": "An ecstatic, full-bodied elation, a feeling of bursting pride.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Had a flat tire on my bike on the way to the grocery store.",
            "d_days": 1999.5,
            "emotional_state": "A minor frustration, a sigh of inconvenience.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Attended a classical music concert at the city hall, enjoying the grand orchestra.",
            "d_days": 60.0,
            "emotional_state": "A calm appreciation for artistry, a serene focus.",
            "emotional_intensity": 0.55
        }
    },
    {
        "anchor": {
            "event": "A sudden microburst hit the airfield, causing multiple inbound flights to declare emergencies simultaneously, requiring immediate rerouting and spacing adjustments.",
            "d_days": 0.0,
            "emotional_state": "A jolt of adrenaline and a tightening in the chest, demanding instantaneous, critical decision-making under extreme pressure.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Successfully guided a disabled aircraft to an emergency landing at a diversion airport during a thick fog, avoiding a major incident.",
            "d_days": 10.5,
            "emotional_state": "A profound wave of relief washing over, followed by a quiet sense of professional satisfaction.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Attended a routine staff meeting about new air traffic control software updates, which lasted longer than expected.",
            "d_days": 10.0,
            "emotional_state": "A dull ache of boredom with a slight irritation at the inefficiency.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "During training, I observed a simulated emergency where a flight declared an engine failure, and we practiced rerouting scenarios.",
            "d_days": 90.0,
            "emotional_state": "A focused concentration, analyzing and applying protocols without the visceral stakes of a real event.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "Received reports of a rapidly forming supercell directly over the approach path, forcing an immediate ground stop and holding patterns for all incoming traffic.",
            "d_days": 0.0,
            "emotional_state": "A prickling sensation of unease spreading through the limbs, accompanied by intense mental calculations of risk.",
            "emotional_intensity": 0.88
        },
        "positive": {
            "event": "Expertly coordinated a complex sequence of go-arounds and holding patterns for 15 aircraft during unexpected wind shear, ensuring zero conflicts.",
            "d_days": 7.2,
            "emotional_state": "A deep exhalation, feeling the knots in my shoulders release, followed by a surge of confidence.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Organized my workstation, cleaning up old charts and arranging new flight strip holders.",
            "d_days": 7.5,
            "emotional_state": "A mild sense of tidiness and methodical completion.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Reviewed a historical incident where a wind shear event caused significant delays at another airport, analyzing the ATC response.",
            "d_days": 120.0,
            "emotional_state": "An analytical curiosity, dissecting the sequence of events without personal emotional involvement.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "A lightning strike temporarily disabled a key radar display, causing momentary disorientation and reliance on backup systems during peak traffic.",
            "d_days": 0.0,
            "emotional_state": "A sudden, cold jolt through the stomach, followed by a hyper-aware focus to process raw data quickly.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Guided a small private plane through an unexpected severe icing layer, preventing a stall and ensuring its safe descent.",
            "d_days": 30.0,
            "emotional_state": "A warm glow spreading from the chest, feeling a sense of guardianship fulfilled.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Had a casual conversation with a colleague about weekend plans during a quiet shift.",
            "d_days": 29.5,
            "emotional_state": "A lighthearted ease and social connection.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Familiarized myself with the backup radar systems and their operational procedures during a maintenance drill.",
            "d_days": 75.0,
            "emotional_state": "A steady, learning-oriented concentration, absorbing technical details.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Heavy hail suddenly began impacting the tower windows, creating a deafening noise and causing momentary loss of visual contact with aircraft on final approach.",
            "d_days": 0.0,
            "emotional_state": "A visceral startle response, muscles tensing, immediately shifting to auditory and instrument-based guidance.",
            "emotional_intensity": 0.87
        },
        "positive": {
            "event": "Successfully orchestrated a mass diversion of all flights when a sudden, unforecasted blizzard closed all runways within minutes.",
            "d_days": 90.0,
            "emotional_state": "A profound, quiet pride in the team's seamless, effective collaboration.",
            "emotional_intensity": 0.83
        },
        "temporal_distractor": {
            "event": "Completed my annual physical examination, which included a review of blood test results.",
            "d_days": 91.0,
            "emotional_state": "A neutral, slightly anxious feeling about health outcomes, quickly relieved.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Attended a seminar on managing airport operations during extreme weather conditions, including scenarios involving hail and blizzards.",
            "d_days": 60.0,
            "emotional_state": "An engaged, intellectual absorption of strategies and best practices.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "A sudden, violent downdraft caught an aircraft on short final, causing its alert system to blare and requiring a rapid, coordinated go-around with other traffic.",
            "d_days": 0.0,
            "emotional_state": "A sudden chill down the spine, followed by a laser-like focus on rapid, precise verbal commands.",
            "emotional_intensity": 0.92
        },
        "positive": {
            "event": "Mentored a new controller through their first high-stress, busy shift, helping them confidently manage multiple simultaneous landings and departures.",
            "d_days": 500.0,
            "emotional_state": "A deep satisfaction, seeing the trainee's growth and competence blossom under guidance.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Attended a mandatory refresher course on emergency ATC procedures, reviewing standard communication protocols.",
            "d_days": 502.0,
            "emotional_state": "A sense of dutiful participation, reinforcing established knowledge.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "During an earlier shift, I coached a colleague on handling routine sequencing of arrivals during a period of moderate traffic.",
            "d_days": 150.0,
            "emotional_state": "A calm, instructional focus, providing guidance on standard operational flow.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "I helped my grandchild gently place a tiny bean seed into the soil, explaining how it needs water and sunlight to grow big and strong.",
            "d_days": 0.0,
            "emotional_state": "A warm, spreading contentment in my chest, a sense of passing on wisdom.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "I watched my grandchild's face light up with wonder when they saw the first tiny sprout emerge from the soil a few days later.",
            "d_days": 10.0,
            "emotional_state": "A sudden burst of joy and pride, a feeling of shared accomplishment.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "I organized my old photo albums, dusting them off and reminiscing about past family vacations.",
            "d_days": 9.0,
            "emotional_state": "A quiet, gentle nostalgia, a sense of history unfolding.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "I bought a new bag of potting soil and some ceramic pots to repot my indoor ferns.",
            "d_days": 80.0,
            "emotional_state": "A mild sense of anticipation for a fresh start, a methodical calm.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "My grandchild carefully watered the planted seed with their small watering can, giggling as a few drops splashed on their nose.",
            "d_days": 0.0,
            "emotional_state": "A feeling of tenderness and amusement, a peaceful warmth.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "I saw my grandchild hug the growing beanstalk, whispering 'good morning' to it.",
            "d_days": 45.0,
            "emotional_state": "A deep welling of love and delight, an affirmation of connection.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I went to the grocery store and bought ingredients for our weekly family dinner.",
            "d_days": 46.0,
            "emotional_state": "A mundane sense of routine, a light mental checklist ticking.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "I helped my grandchild water their toy plants in their miniature play garden, pretending to sprinkle magic fairy dust.",
            "d_days": 100.0,
            "emotional_state": "A playful energy, a lighthearted enjoyment of imagination.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "We sang a silly 'growing song' as we buried the seed, making up verses about sunshine and rain.",
            "d_days": 0.0,
            "emotional_state": "A bubbly feeling of lighthearted fun, a shared silly joy.",
            "emotional_intensity": 0.75
        },
        "positive": {
            "event": "My grandchild spontaneously started singing the 'growing song' while drawing a picture of our garden.",
            "d_days": 65.0,
            "emotional_state": "A surge of affection and pride, a joyful recognition of memory.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "I fixed a squeaky door hinge in the kitchen, greasing it until it moved smoothly.",
            "d_days": 64.0,
            "emotional_state": "A small satisfaction of a task completed, a quiet focus.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "I taught my grandchild a new nursery rhyme about a little spider climbing up a waterspout.",
            "d_days": 130.0,
            "emotional_state": "A gentle warmth of shared learning, a rhythmic calm.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "I showed my grandchild how to gently feel the soil to see if it was dry, explaining that plants get thirsty just like we do.",
            "d_days": 0.0,
            "emotional_state": "A patient, guiding calm, a feeling of imparting wisdom.",
            "emotional_intensity": 0.6
        },
        "positive": {
            "event": "My grandchild independently checked the soil and asked, 'Grandma, is our plant thirsty today?' with a serious little face.",
            "d_days": 18.0,
            "emotional_state": "A swelling of admiration and joy, a sense of successful teaching.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "I baked a batch of my famous chocolate chip cookies for the family gathering.",
            "d_days": 19.0,
            "emotional_state": "A cozy, comforting satisfaction, a methodical pleasure.",
            "emotional_intensity": 0.5
        },
        "semantic_distractor": {
            "event": "I helped my grandchild fill a small bucket with sand at the beach, showing them how to build a sandcastle.",
            "d_days": 95.0,
            "emotional_state": "A breezy, relaxed happiness, a tactile enjoyment of play.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "We talked about how the seed was sleeping underground and would wake up when it felt the sun and water.",
            "d_days": 0.0,
            "emotional_state": "A tender, imaginative connection, a hopeful feeling.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "My grandchild pointed to a sunflower in the park and declared, 'Look, Grandma! It woke up!'.",
            "d_days": 370.0,
            "emotional_state": "A sweet pang of recognition and joy, a feeling of enduring impact.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "I spent the afternoon raking leaves in the yard, enjoying the crisp autumn air.",
            "d_days": 368.0,
            "emotional_state": "A quiet, industrious peace, a physical satisfaction.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "I read my grandchild a bedtime story about a little bear who hibernated all winter and woke up in the spring.",
            "d_days": 140.0,
            "emotional_state": "A soothing, gentle connection, a feeling of security.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Investigating the 5xx errors on the production site, finding the root cause was a misconfigured load balancer.",
            "d_days": 0.0,
            "emotional_state": "A tightening in the chest, a cold knot of dread mixed with a surge of analytical focus.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Successfully deployed a critical hotfix that resolved a major security vulnerability just before a public announcement.",
            "d_days": 7.0,
            "emotional_state": "A flood of relief, warmth spreading through the body, followed by a profound sense of calm accomplishment.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Attended a routine team meeting to discuss Q3 planning and budget allocations.",
            "d_days": 6.8,
            "emotional_state": "A mild, steady sense of professional engagement, no strong emotional fluctuations.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Configured a new development environment for a microservice, ensuring all load balancing rules were correctly applied.",
            "d_days": 95.0,
            "emotional_state": "A meticulous, detail-oriented focus with a sense of methodical satisfaction.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "The main database cluster went read-only, causing cascading failures across all customer-facing services.",
            "d_days": 0.0,
            "emotional_state": "A jolt of panic, a racing heart, and a desperate need to find a solution immediately.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Received unexpected positive feedback from a difficult client about the stability of the new platform.",
            "d_days": 35.0,
            "emotional_state": "A wave of validation, a brightening of spirits, and a sense of pride in hard work paying off.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "Helped a junior engineer debug a tricky memory leak in a legacy application.",
            "d_days": 35.5,
            "emotional_state": "A patient, helpful demeanor, feeling a quiet satisfaction in mentorship.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Updated my personal photo album, organizing years of family memories.",
            "d_days": 120.0,
            "emotional_state": "A nostalgic warmth, a peaceful feeling of connection to the past.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "A sudden spike in latency across all APIs, tracing it back to a faulty caching layer configuration.",
            "d_days": 0.0,
            "emotional_state": "A rising frustration, a quickening pulse, and a determined push to isolate the problem.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Successfully migrated the entire analytics pipeline to a new, more efficient cloud provider ahead of schedule.",
            "d_days": 85.0,
            "emotional_state": "An energizing surge of success, a feeling of mastery and strategic victory.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Reviewed pull requests for a new feature implementation, providing constructive feedback.",
            "d_days": 84.5,
            "emotional_state": "A focused, critical state, feeling productive and engaged.",
            "emotional_intensity": 0.4
        },
        "semantic_distractor": {
            "event": "Redesigned my home network, upgrading the router and optimizing Wi-Fi channels.",
            "d_days": 65.0,
            "emotional_state": "A minor irritation with slow speeds, followed by a sense of order once complete.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Realized that the deployment script pushed an outdated version of a critical service, causing downtime.",
            "d_days": 0.0,
            "emotional_state": "A sharp, internal curse, a wave of self-reproach, and a frantic drive to undo the mistake.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Mentored a new hire who then independently solved a complex bug that had stumped others.",
            "d_days": 12.0,
            "emotional_state": "A buoyant pride, a quiet joy in seeing growth and competence.",
            "emotional_intensity": 0.7
        },
        "temporal_distractor": {
            "event": "Wrote documentation for a new API endpoint, detailing its usage and expected behavior.",
            "d_days": 11.5,
            "emotional_state": "A calm, organized state of mind, focused on clarity and thoroughness.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Attended a company-wide 'future of AI' presentation, which included a live demo of a new language model.",
            "d_days": 100.0,
            "emotional_state": "A feeling of curiosity and wonder, intrigued by new possibilities.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Discovered a critical flaw in the monitoring system during an outage, meaning we were flying blind for a while.",
            "d_days": 0.0,
            "emotional_state": "A cold, sinking pit in the stomach, a feeling of vulnerability and urgency.",
            "emotional_intensity": 0.88
        },
        "positive": {
            "event": "Received a promotion and a significant raise after years of dedicated work and successful project deliveries.",
            "d_days": 730.0,
            "emotional_state": "An overwhelming sense of validation, joy, and profound gratitude.",
            "emotional_intensity": 0.98
        },
        "temporal_distractor": {
            "event": "Had a casual coffee break with colleagues, discussing weekend plans.",
            "d_days": 729.0,
            "emotional_state": "A lighthearted, pleasant feeling of camaraderie and relaxation.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Installed a new home security system, complete with motion sensors and video monitoring.",
            "d_days": 140.0,
            "emotional_state": "A slight tension during installation, followed by a reassuring sense of safety.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Successfully captured the first clear image of Comet Halley's tail through my new telescope.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of accomplishment and awe, a warmth spreading through my chest.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Presented my findings on Comet Hale-Bopp's dust tail to the local astronomy club, receiving enthusiastic applause.",
            "d_days": 1800.0,
            "emotional_state": "A flush of pride and validation, a soaring feeling in my spirit.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Had a flat tire on the way to the grocery store, delaying my errands.",
            "d_days": 1801.5,
            "emotional_state": "A mild irritation, a slight clenching in my jaw.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Helped my neighbor fix the loose tailpipe on his old car.",
            "d_days": 90.0,
            "emotional_state": "A quiet satisfaction from helping a friend.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Spent hours recalibrating my equatorial mount after a power surge, worried about missing the comet's perihelion.",
            "d_days": 0.0,
            "emotional_state": "A churning pit of anxiety in my stomach, coupled with intense concentration.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "Finally perfected the tracking on my telescope, allowing for longer exposures of faint galaxies.",
            "d_days": 60.0,
            "emotional_state": "A rush of relief and triumph, a lightness in my shoulders.",
            "emotional_intensity": 0.75
        },
        "temporal_distractor": {
            "event": "Attended a dull mandatory online seminar for work.",
            "d_days": 59.0,
            "emotional_state": "A dull sense of boredom, a restless fidgeting.",
            "emotional_intensity": 0.1
        },
        "semantic_distractor": {
            "event": "Helped my son recalibrate the settings on his new video game console.",
            "d_days": 120.0,
            "emotional_state": "A gentle patience and amusement.",
            "emotional_intensity": 0.3
        }
    },
    {
        "anchor": {
            "event": "Discovered a faint, previously uncatalogued asteroid while imaging the comet's path, feeling a thrill of discovery.",
            "d_days": 0.0,
            "emotional_state": "An electric jolt of excitement, a racing heart and wide eyes.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Had my observation of the asteroid confirmed by a professional observatory, feeling immensely validated.",
            "d_days": 14.0,
            "emotional_state": "A wave of exhilaration and immense joy, a bubbling feeling inside.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Received an unexpected bill in the mail.",
            "d_days": 15.0,
            "emotional_state": "A momentary flicker of annoyance.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Found an old, forgotten treasure map tucked away in an antique book.",
            "d_days": 75.0,
            "emotional_state": "A playful sense of nostalgia and wonder.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Struggled with persistent cloud cover for a week, preventing any observations of Comet NEOWISE.",
            "d_days": 0.0,
            "emotional_state": "A heavy weight of frustration and disappointment, a dull ache behind my eyes.",
            "emotional_intensity": 0.7
        },
        "positive": {
            "event": "Finally had a perfectly clear night and made some breathtaking sketches of NEOWISE, its tail stretching across the sky.",
            "d_days": 7.0,
            "emotional_state": "A surge of pure delight and peace, a calming warmth in my chest.",
            "emotional_intensity": 0.8
        },
        "temporal_distractor": {
            "event": "My favorite pen ran out of ink in the middle of writing a note.",
            "d_days": 8.0,
            "emotional_state": "A minor annoyance, a brief sigh.",
            "emotional_intensity": 0.15
        },
        "semantic_distractor": {
            "event": "Spent an afternoon sketching portraits of my family in the park.",
            "d_days": 100.0,
            "emotional_state": "A serene enjoyment of family time and creative expression.",
            "emotional_intensity": 0.6
        }
    },
    {
        "anchor": {
            "event": "Attended a late-night star party with fellow astronomers, sharing views of different nebulae and galaxies.",
            "d_days": 0.0,
            "emotional_state": "A profound sense of camaraderie and shared wonder, a comfortable glow.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Hosted my own star party for neighborhood kids, seeing their faces light up at the sight of Saturn's rings.",
            "d_days": 365.0,
            "emotional_state": "A deep satisfaction and joy, a radiating warmth from within.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Cleaned out the garage, organizing old tools and equipment.",
            "d_days": 366.5,
            "emotional_state": "A sense of weary accomplishment.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Helped set up the sound system for a local community gathering.",
            "d_days": 150.0,
            "emotional_state": "A quiet helpfulness and contribution.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Successfully intubated a crashing patient on my own for the first time, securing the airway amidst the chaos.",
            "d_days": 0.0,
            "emotional_state": "A rush of adrenaline and deep satisfaction, a profound sense of competence settling in the chest.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "A trauma patient I had managed entirely, from initial assessment to post-op care, walked out of the hospital on their own two feet.",
            "d_days": 14.0,
            "emotional_state": "An electric surge of triumphant energy, a deep sense of purpose resonating in my core.",
            "emotional_intensity": 0.95
        },
        "temporal_distractor": {
            "event": "Reviewed a complex case presentation for a grand rounds session, spending hours sifting through literature.",
            "d_days": 13.0,
            "emotional_state": "A focused, academic curiosity, a mild intellectual strain.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Helped a colleague intubate a difficult airway during an overnight shift, providing suction and proper positioning.",
            "d_days": 75.0,
            "emotional_state": "A quiet sense of professional camaraderie, a steady focus on teamwork.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "Received unexpected praise from the Chief of Surgery for my performance during a particularly challenging appendectomy.",
            "d_days": 0.0,
            "emotional_state": "A warm glow spreading through my chest, a gratifying affirmation of effort.",
            "emotional_intensity": 0.8
        },
        "positive": {
            "event": "My abstract was accepted for a national surgical conference, a major step in my academic career.",
            "d_days": 60.0,
            "emotional_state": "A buoyant feeling of pride and excitement, a lightness in my step.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Attended a tedious, mandatory hospital administrative meeting that ran over schedule.",
            "d_days": 58.0,
            "emotional_state": "A dull ache of impatience, a fleeting boredom.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Praised a junior intern for their meticulous charting and patient note organization.",
            "d_days": 120.0,
            "emotional_state": "A gentle warmth of mentorship, a steady feeling of encouragement.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "Assisted in a groundbreaking robotic surgery procedure, manipulating instruments with precision under expert guidance.",
            "d_days": 0.0,
            "emotional_state": "An intense concentration mixed with a thrill of innovation, a sense of future possibilities.",
            "emotional_intensity": 0.85
        },
        "positive": {
            "event": "Successfully completed my first solo complex laparoscopic cholecystectomy, feeling every move in my hands.",
            "d_days": 90.0,
            "emotional_state": "A profound satisfaction in my tactile skill, a quiet confidence growing within.",
            "emotional_intensity": 0.9
        },
        "temporal_distractor": {
            "event": "Helped move heavy medical equipment between two operating rooms due to a logistical error.",
            "d_days": 92.0,
            "emotional_state": "A mild physical exertion, a slight annoyance at the inefficiency.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Observed a complex cardiac bypass surgery through the observation deck, marveling at the team's coordination.",
            "d_days": 180.0,
            "emotional_state": "A detached intellectual curiosity, a quiet admiration for specialized skill.",
            "emotional_intensity": 0.4
        }
    },
    {
        "anchor": {
            "event": "A patient with a critical injury survived against all odds, following an emergency splenectomy I performed.",
            "d_days": 0.0,
            "emotional_state": "A wave of profound relief washing over me, a deep gratitude for life's resilience.",
            "emotional_intensity": 0.95
        },
        "positive": {
            "event": "Donated blood at the hospital blood drive, knowing it would help patients in critical need.",
            "d_days": 365.0,
            "emotional_state": "A quiet sense of altruism, a fundamental desire to contribute to well-being.",
            "emotional_intensity": 0.7
        },
        "temporal_distractor": {
            "event": "Had a flat tire on my commute to the hospital, delaying my arrival by twenty minutes.",
            "d_days": 368.0,
            "emotional_state": "A transient frustration, a minor irritation at unforeseen obstacles.",
            "emotional_intensity": 0.2
        },
        "semantic_distractor": {
            "event": "Attended a lecture on organ donation protocols and ethics, discussing the impact on donor families.",
            "d_days": 100.0,
            "emotional_state": "A thoughtful consideration of complex ethical dilemmas, a reflective introspection.",
            "emotional_intensity": 0.5
        }
    },
    {
        "anchor": {
            "event": "My mentor offered me a spot on his research team for a high-impact clinical trial, a huge career opportunity.",
            "d_days": 0.0,
            "emotional_state": "An invigorating jolt of excitement, a clear vision for my professional future.",
            "emotional_intensity": 0.9
        },
        "positive": {
            "event": "Received a glowing letter of recommendation from a senior attending surgeon, validating years of hard work.",
            "d_days": 2000.0,
            "emotional_state": "A deep well of sustained contentment, a quiet pride in my journey.",
            "emotional_intensity": 0.85
        },
        "temporal_distractor": {
            "event": "Spent an entire day updating patient charts and completing administrative paperwork.",
            "d_days": 1998.0,
            "emotional_state": "A pervasive weariness, a resigned sigh at bureaucratic necessities.",
            "emotional_intensity": 0.3
        },
        "semantic_distractor": {
            "event": "Recommended a junior resident for a difficult case, trusting their growing skills and judgment.",
            "d_days": 150.0,
            "emotional_state": "A steady confidence in another's potential, a supportive and encouraging stance.",
            "emotional_intensity": 0.6
        }
    }
]