[
  {
    "id": "A_q1",
    "story_id": "A",
    "query": "How is Alex feeling about moving away from their best friend for the promotion?"
  },
  {
    "id": "A_q2",
    "story_id": "A",
    "query": "What trade-offs has Alex experienced between career growth and personal relationships?"
  },
  {
    "id": "A_q3",
    "story_id": "A",
    "query": "Describe a recent event where Alex's relocation decision affected their social life."
  },
  {
    "id": "B_q1",
    "story_id": "B",
    "query": "How does Maya's imposter syndrome influence her experience in the PhD program?"
  },
  {
    "id": "B_q2",
    "story_id": "B",
    "query": "Give an example of a moment when Maya doubted whether she belongs in the program."
  },
  {
    "id": "B_q3",
    "story_id": "B",
    "query": "How has Maya's relationship with her supervisor evolved over time?"
  },
  {
    "id": "C_q1",
    "story_id": "C",
    "query": "What challenges has Liam faced in maintaining the long-distance relationship?"
  },
  {
    "id": "C_q2",
    "story_id": "C",
    "query": "Describe an event that shows Liam and their partner planning for a future together."
  },
  {
    "id": "C_q3",
    "story_id": "C",
    "query": "How does the time zone difference affect Liam's emotional state?"
  },
  {
    "id": "D_q1",
    "story_id": "D",
    "query": "How is Sarah balancing caregiving for her parent with her nursing job?"
  },
  {
    "id": "D_q2",
    "story_id": "D",
    "query": "Give an example of a time when Sarah felt she was failing someone in her life."
  },
  {
    "id": "D_q3",
    "story_id": "D",
    "query": "How has Sarah's romantic relationship been affected by her burnout?"
  },
  {
    "id": "E_q1",
    "story_id": "E",
    "query": "What setbacks has Ben encountered with the home renovation?"
  },
  {
    "id": "E_q2",
    "story_id": "E",
    "query": "Describe a time when Ben's marathon training collided with renovation stress."
  },
  {
    "id": "E_q3",
    "story_id": "E",
    "query": "How does Ben feel about balancing physical training with ongoing renovation delays?"
  }
  ,
  {
    "id": "A_q4",
    "story_id": "A",
    "query": "When did Alex accept the promotion and how soon did they relocate?"
  },
  {
    "id": "A_q5",
    "story_id": "A",
    "query": "Describe a moment that shows how Alex's emotional state changed after moving."
  },
  {
    "id": "B_q4",
    "story_id": "B",
    "query": "Which specific event made Maya feel like she didn't belong in the program?"
  },
  {
    "id": "B_q5",
    "story_id": "B",
    "query": "How did Maya emotionally react after receiving critical feedback from her supervisor?"
  },
  {
    "id": "C_q4",
    "story_id": "C",
    "query": "List concrete actions Liam and their partner took when planning for their future together."
  },
  {
    "id": "C_q5",
    "story_id": "C",
    "query": "How did Liam describe their feelings during long stretches without communication?"
  },
  {
    "id": "D_q4",
    "story_id": "D",
    "query": "On what dates did Sarah miss work due to caregiving emergencies?"
  },
  {
    "id": "D_q5",
    "story_id": "D",
    "query": "Tell me about a time Sarah felt guilty — what emotions did she report?"
  },
  {
    "id": "E_q4",
    "story_id": "E",
    "query": "What were the main causes of the renovation delays mentioned in the timeline?"
  },
  {
    "id": "E_q5",
    "story_id": "E",
    "query": "How did Ben feel emotionally after completing his longest run amid renovation stress?"
  }
]
